TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ФормированиеНомераПробы/гкс_ФормированиеНомераПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ФормированиеНомераПробы</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>CatalogRef.гкс_НомерПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСуткиРегистрации</name>
    <comment>ERP-1431</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРегистраций</name>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента/гкс_СвязьРегистрацииИТранспортногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СвязьРегистрацииИТранспортногоДокумента</name>
  <comment>Транспортные документы регистрации</comment>
  <resources>
    <name>ТранспортныйДокумент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиПечатиФормированияПроб/гкс_НастройкиПечатиФормированияПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиПечатиФормированияПроб</name>
  <resources>
    <name>КоличествоЭтикеток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГОСТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <comment>ERP-1220</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияРегистрации</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоПоПревышениюМаксимальногоВеса</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтборуПроб</name>
  </enumValues>
  <enumValues>
    <name>ВзятыПробы</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПринятыПробы</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаРазрешена</name>
    <comment>ERP-2029</comment>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
    <comment>ERP-2029</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РегистрацияНаПЛК/гкс_РегистрацияНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияНаПЛК</name>
  <basedOn>Document.гкс_ВъездНаКПП</basedOn>
  <registerRecords>AccumulationRegister.гкс_СДИЗНаПЛК</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПолучатель</name>
    <comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВъезда</name>
    <comment>Точка маршрута для определения проезда</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДРейса</name>
    <comment>ERP-2176</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроляСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесоваяВъезда</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОтгрузкуПродукции</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаСОдногоБорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.гкс_ПрибытиеСуднаНаПЛК</types>
      <types>DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</types>
      <types>DocumentRef.гкс_ВъездНаКПП</types>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </attributes>
  <attributes>
    <name>СДИЗ</name>
    <type>
      <types>CatalogRef.гкс_СДИЗЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_НаправлениеНаРазгрузку/гкс_НаправлениеНаРазгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_НаправлениеНаРазгрузку</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйСтатус</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯмаРазгрузки</name>
    <comment>ERP-1094</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеМестаРазгрузки</name>
    <attributes>
      <name>Силос</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>СлужебнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяРазгрузка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯмаРазгрузки</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_НомерПробы/гкс_НомерПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_НомерПробы</name>
  <attributes>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРегистраций</name>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ФормированиеНомераПробы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("ПриемкаПЛК");
	МеханизмыДокумента.Добавить("ЛабораторияИКачество");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * Таблица<ИмяРегистра> - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		
		ДополнительныеСвойства = ДопПараметры.ДополнительныеСвойства;
		
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ, ДопПараметры, ДополнительныеСвойства);
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		Если ДопПараметры.ДополнительныеСвойства.Свойство("ТипПробы") 
			И ДопПараметры.ДополнительныеСвойства.ТипПробы = ПредопределенноеЗначение("Перечисление.гкс_ТипыПроб.Композитная") Тогда
			
			ТекстЗапросаТаблицагкс_КомпозитныеПробы(ТекстыЗапроса, Регистры);
			
		// Пропуск проводки по СостоянияРегистрации через параметр 
		// из АРМ "Промежуточный композит" вкладка Усиленный контроль для ТС
		ИначеЕсли Не ЭтоУсиленныйКонтрольДляТС(ДопПараметры) Тогда 
			ТекстЗапросаТаблицаСостояниеРегистрации(ТекстыЗапроса, Регистры);	
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_Этикетка";
	КомандаПечати.Представление = НСтр("ru = 'Этикетка';en = 'Label'");	
	КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФ_MXL_Этикетка";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_АктОтбораКП";
	КомандаПечати.Идентификатор = "ПФ_MXL_АктОтбораКП";
	КомандаПечати.Представление = НСтр("ru = 'Акт отбора образцов композитной пробы';
									   |en = 'Act of composite sampling'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_АктОтбораПроб";
	КомандаПечати.Представление = НСтр("ru = 'Акт отбора проб новый'");
    КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФ_MXL_АктОтбораПроб";             
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Этикетка") Тогда
		ТабличныйДокумент = ПечатьЭтикетки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Этикетка", НСтр("ru = 'Макет этикетки';
															|en = 'Label layout'"), ТабличныйДокумент);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОтбораКП") Тогда		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_АктОтбораКП",
			НСтр("ru = 'Акт отбора образцов композитной пробы';
				|en = 'Act of composite sampling'"),
			СформироватьПечатнуюФормаАктОтбораКП(МассивОбъектов, ОбъектыПечати, ПараметрыПечати), ,
			"Документ.гкс_ФормированиеНомераПробы.ПФ_MXL_АктОтбораКП");
	КонецЕсли;

КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

// Получить по регистрации.
// 
// Параметры:
//  РегистрацияНаПЛК - ДокументСсылка.гкс_РегистрацияНаПЛК - доекумент регистрации транспорта
//  ТипПробы - ПеречислениеСсылка.гкс_ТипыПроб - тип пробы
// 
// Возвращаемое значение:
//  ДокументСсылка.гкс_ФормированиеНомераПробы
//
Функция ДокументПоРегистрацииТипуПробы(РегистрацияНаПЛК, ТипПробы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации,
	|	ФормированиеНомераПробыСписокРегистраций.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ФормированиеНомераПробы.Ссылка
	|		И ФормированиеНомераПробы.ТипПробы = &ТипПробы
	|ГДЕ
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = &ДокументРегистрации";

	Запрос.УстановитьПараметр("ДокументРегистрации", РегистрацияНаПЛК);
	Запрос.УстановитьПараметр("ТипПробы", ТипПробы);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	Иначе	
		Результат = Неопределено;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Создает и проводит документ формирования номера пробы для АРМ Промежуточный Композит.
//
// Параметры:
//  ПараметрыСоздания - Структура - параметры для создания документа:
//   * ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - точка маршрута
//   * ПроизводственныеСуткиРегистрации - Дата - производственные сутки регистрации
//   * ТаблицаРегистраций - ТаблицаЗначений - таблица с регистрациями, содержащая те же поля,
//                                            что и табличная часть СписокРегистраций документа
//
// Возвращаемое значение:
//  ДокументСсылка.гкс_ФормированиеНомераПробы - ссылка на созданный и проведенный документ
//
Функция ДокументПромежуточногоКомпозита(ПараметрыСоздания, ПараметрыСозданияАнализа = Неопределено) Экспорт

	// Создание нового документа
	ДокументОбъект = СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.ТочкаМаршрута = ПараметрыСоздания.ТочкаМаршрута;
	ДокументОбъект.ТипПробы = ПараметрыСоздания.ТипПробы;
	
	ДокументОбъект.ПроизводственныеСуткиРегистрации = ПараметрыСоздания.ПроизводственныеСуткиРегистрации;
	ДокументОбъект.ДополнительныеСвойства.Вставить("ПараметрыСозданияАнализа", ПараметрыСозданияАнализа);
    ДокументОбъект.ДополнительныеСвойства.Вставить("ТипПробы", ПараметрыСоздания.ТипПробы);

	ДокументОбъект.ДополнительныеСвойства.Вставить("ЭтоУсиленныйКонтрольДляТС", 
		ПараметрыСоздания.ЭтоУсиленныйКонтрольДляТС);
    
    
	// Заполнение табличной части регистраций
	Для Каждого Строка Из ПараметрыСоздания.ТаблицаРегистраций Цикл
		НоваяРегистрация = ДокументОбъект.СписокРегистраций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяРегистрация, Строка);
	КонецЦикла;

	// Формирование номера пробы
	Отказ = Ложь;
	СформироватьНомерПробы(ДокументОбъект, Отказ);

	Если Отказ Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка при формировании номера пробы'");
	КонецЕсли;

	// Установка местной даты с учетом часового пояса
	ЧасовойПоясПЛК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.ТочкаМаршрута,
			"гкс_ЧасовойПоясТочкиМаршрута");

	Если ЗначениеЗаполнено(ЧасовойПоясПЛК) Тогда
		ДокументОбъект.МестнаяДата = МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПоясПЛК);
	Иначе
		ДокументОбъект.МестнаяДата = ДокументОбъект.Дата;
	КонецЕсли;

	// Запись и проведение документа	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ФормированиеНомераПробы.Проведение'"), 
								УровеньЖурналаРегистрации.Ошибка,
								Метаданные.Документы.гкс_ФормированиеНомераПробы, ,
								ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;

	Возврат ДокументОбъект.Ссылка;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПервыйДокументИзСпискаРегистраций(ФормированиеНомераПробы) Экспорт
	
	Результат = Неопределено;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|ГДЕ
	|	ФормированиеНомераПробыСписокРегистраций.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ФормированиеНомераПробы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		Результат = ВыборкаДетальныеЗаписи.ДокументРегистрации;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список документов регистраций по документу
//
// Параметры:
// 	ФормированиеНомераПробы - ДокументСсылка.гкс_ФормированиеНомераПроб
//
// Возвращаемое значение:
//	Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - документы регистрации из табличной части
//
Функция ДокументыРегистрацииФормированияНомераПроб(ФормированиеНомераПробы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|ГДЕ
	|	ФормированиеНомераПробыСписокРегистраций.Ссылка = &Ссылка
	|	И ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации <> ЗНАЧЕНИЕ(Документ.гкс_РегистрацияНаПЛК.ПустаяСсылка)";

	Запрос.УстановитьПараметр("Ссылка", ФормированиеНомераПробы);

	Результат = Запрос.Выполнить().Выгрузить();
	    
	Возврат Результат.ВыгрузитьКолонку("ДокументРегистрации");
		
КонецФункции

Процедура СформироватьНомерПробы(ДокументОбъект, Отказ) Экспорт
	
	НовыйНомерПробы = Справочники.гкс_НомерПробы.СоздатьЭлемент();
	НовыйНомерПробы.ТипПробы = ДокументОбъект.ТипПробы;
	НовыйНомерПробыСписокРегистраций = НовыйНомерПробы.СписокРегистраций;

	Для Каждого СтрокаРегистрация Из ДокументОбъект.СписокРегистраций Цикл
		Если ЗначениеЗаполнено(СтрокаРегистрация.ДокументРегистрации) Тогда
			НоваяРегистрация = НовыйНомерПробыСписокРегистраций.Добавить();
			НоваяРегистрация.ДокументРегистрации = СтрокаРегистрация.ДокументРегистрации;
		КонецЕсли;
	КонецЦикла;
	
	Если НовыйНомерПробыСписокРегистраций.Количество() > 0 Тогда
		НовыйНомерПробы.Записать();
		ДокументОбъект.НомерПробы = НовыйНомерПробы.Ссылка;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр
		("ru = 'Отсутствует регистрация. Номер пробы не сформирован'"));
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура СоздатьНовыйДокумент(ДанныеЗаполнения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокумент = СоздатьДокумент();
	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура СформироватьЛабораторныйАнализПоНеобходимости(ФормированиеНомераПробы, ТипПробы = Неопределено,
	ДополнительныеДанныеЗаполнения = Неопределено) Экспорт
	
	НазначениеИспользованияКачества = Неопределено;
	Если ДополнительныеДанныеЗаполнения <> Неопределено Тогда
		
		ДополнительныеДанныеЗаполнения.Свойство("гкс_НазначениеИспользованияКачества",
			НазначениеИспользованияКачества);
			
		ПоказателиДляЗаполнения = Новый Массив;
		Если ДополнительныеДанныеЗаполнения.Свойство("ПоказателиДляЗаполнения") Тогда
			ПоказателиДляЗаполнения = ДополнительныеДанныеЗаполнения.ПоказателиДляЗаполнения;
		КонецЕсли;	
			
	КонецЕсли;
			
	РегистрацияТранспорта = ПервыйДокументИзСпискаРегистраций(ФормированиеНомераПробы);	
	ДокументОснование = ДокументОснованиеДляФормированияЛабораторногоАнализа(ФормированиеНомераПробы, 
		РегистрацияТранспорта);
	
	Если ПроверитьФормированияЛабораторногоАнализа(ДокументОснование, ТипПробы, НазначениеИспользованияКачества) Тогда
			
		ИмяСобытия = НСтр("ru = 'Формирование лабораторного анализа'");
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Лабораторный анализ по документу-основанию %1 уже существует. Повторное создание отменено.'"),
			ДокументОснование);
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,
			Метаданные.Документы.гкс_ФормированиеНомераПробы, ФормированиеНомераПробы, ТекстСообщения);
		Возврат;
		
	КонецЕсли;
		
	ДанныеЗаполнения = ДанныеДляФормированияЛабораторногоАнализа(ФормированиеНомераПробы, РегистрацияТранспорта);
	
	Если ДополнительныеДанныеЗаполнения <> Неопределено 
		И ДополнительныеДанныеЗаполнения.Свойство("гкс_НазначениеИспользованияКачества") Тогда 
			
		ДанныеЗаполнения.Вставить("гкс_НазначениеИспользованияКачества", 
			НазначениеИспользованияКачества);

		ДанныеЗаполнения.Вставить("МассивПоказателей", ПоказателиДляЗаполнения);
	Иначе 	
		ДанныеЗаполнения.Вставить("гкс_НазначениеИспользованияКачества", 
			Перечисления.гкс_НазначенияИспользованияКачества
				.ЗначениеПоДокументуФормированиеНомераПробы(ФормированиеНомераПробы));
	КонецЕсли;
		      
	Параметры = Новый Структура("ДанныеЗаполнения, ДополнительныеСвойства", 
								ДанныеЗаполнения,
								Новый Структура("ЭтоНомерПробы", Истина));
								 
	СозданныйЛабораторныйАнализ = Документы.гкс_ЛабораторныйАнализ.СоздатьДокументНаОсновании(Параметры);
	Если ДополнительныеДанныеЗаполнения = Неопределено Тогда 
		ДополнительныеДанныеЗаполнения = Новый Структура("СозданныйЛабораторныйАнализ", Неопределено);
	КонецЕсли;
	ДополнительныеДанныеЗаполнения.Вставить("СозданныйЛабораторныйАнализ", СозданныйЛабораторныйАнализ);

КонецПроцедуры

#Область Печать

Функция КлючОбъектаПользовательскихНастроек() Экспорт
	
	Возврат "Документ.гкс_ФормированиеНомераПробы";
	
КонецФункции

Функция НастройкиПечатиПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Подразделение", "");
	Результат.Вставить("ДолжностьПодписанта", "");
	Результат.Вставить("ЮрЛицо", Справочники.Контрагенты.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти       

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры, ДополнительныеСвойства)
	
	МенеджерВременныхТаблиц = Неопределено;
	
	Если ДопПараметры <> Неопределено
		И ДопПараметры.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц) Тогда
		
		МенеджерВременныхТаблиц = ?(МенеджерВременныхТаблиц = Неопределено,
									Новый МенеджерВременныхТаблиц,
									МенеджерВременныхТаблиц);
		
	Иначе
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		    
КонецПроцедуры

Функция ЭтоУсиленныйКонтрольДляТС(ДопПараметры)
	Возврат ДопПараметры.ДополнительныеСвойства.Свойство("ЭтоУсиленныйКонтрольДляТС")
			И ДопПараметры.ДополнительныеСвойства.ЭтоУсиленныйКонтрольДляТС ;
КонецФункции


#КонецОбласти

#Область Печать

Функция ПечатьЭтикетки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено) Экспорт
	
	Перем ДокументРегистрацияНаПЛК; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыПечати <> Неопределено
		И ПараметрыПечати.Свойство("ДокументРегистрацияНаПЛК") Тогда
		ДокументРегистрацияНаПЛК = ПараметрыПечати.ДокументРегистрацияНаПЛК; 		
	КонецЕсли; 
	
	ДанныеДляПечати = ПолучитьДанныеДляПечатиЭтикеток(МассивОбъектов, ДокументРегистрацияНаПЛК);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_гкс_ФормированиеНомераПробы_ПФ_MXL_Этикетка";
	
	ПервыйДокумент = Истина;
	
	КоличествоЭкземпляров = 1;
	Пока ДанныеДляПечати.Следующий() Цикл
		
		// Добавлен макет станции отправления для этикетки
		Если Не ДанныеДляПечати.ТипПробы = Перечисления.гкс_ТипыПроб.Композитная Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.гкс_ФормированиеНомераПробы.ПФ_MXL_Этикетка");
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы(
				"Документ.гкс_ФормированиеНомераПробы.ПФ_MXL_ЭтикеткаСтанцияОтправления");
		КонецЕсли;
			
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
		Шапка = Макет.ПолучитьОбласть("Этикетка");
		Если ДанныеДляПечати.ТипПробы = Перечисления.гкс_ТипыПроб.Композитная Тогда		
			ТекстДополнение = ?(ПараметрыПечати.Свойство("ДоВыгрузки"), " до выгрузки", "");	
			Шапка.Параметры.ТранспортноеСредство = СтрШаблон("Композитный анализ%1", ТекстДополнение);
			Шапка.Параметры.Силос				 = ДанныеДляПечати.Силос;
		Иначе
			Шапка.Параметры.ТранспортноеСредство = ДанныеДляПечати.ТранспортноеСредствоПредставление;
		КонецЕсли;
		Шапка.Параметры.Контрагент = ДанныеДляПечати.КонтрагентПредставление;
		
		// Добавлено заполнение параметра станции отправления для этикетки 
		Если ДанныеДляПечати.ТипПробы = Перечисления.гкс_ТипыПроб.Композитная Тогда
			Шапка.Параметры.СтанцияОтправления = ДанныеДляПечати.СтанцияОтправленияНаименование;
		КонецЕсли;
		
		Шапка.Параметры.ДатаПробы = Формат(ДанныеДляПечати.ДатаПробы, "ДФ=дд.ММ.гггг");
	
		ТабличныйДокумент.Вывести(Шапка);
		ТабличныйДокумент.КоличествоЭкземпляров = ДанныеДляПечати.КоличествоЭкземпляров;
		
		Если ЕстьШтрихкод(ТабличныйДокумент.Рисунки) Тогда
			ЗаполнитьШтрихкод(ТабличныйДокумент.Рисунки.КартинкаШтрихкода, ДанныеДляПечати.НомерПробы);
		КонецЕсли;

		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, 
			ОбъектыПечати, 
			ДанныеДляПечати.ДокументФормированияНомераПробы);
			
		КоличествоЭкземпляров = ?(КоличествоЭкземпляров < ДанныеДляПечати.КоличествоЭкземпляров, 
			ДанныеДляПечати.КоличествоЭкземпляров, КоличествоЭкземпляров);	
		
	КонецЦикла;
	
	Отступ = 3;
	ТабличныйДокумент.ПолеСверху = Отступ;
	ТабличныйДокумент.ПолеСлева = Отступ;
	ТабличныйДокумент.ПолеСнизу = Отступ;
	ТабличныйДокумент.ПолеСправа = Отступ;
	ТабличныйДокумент.РазмерКолонтитулаСверху = Отступ;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = Отступ;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ТабличныйДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
		
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормаАктОтбораКП(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_гкс_ФормированиеНомераПробы_АктОтбораКП";
	
	СтруктураПараметровПечати = Новый Структура;
	РеквизитыЮрЛица = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыПечати.ЮрЛицо, "Наименование,Адрес", Истина);
	СтруктураПараметровПечати = Новый Структура ("НаименованиеОрганизации, АдресОрганизации", 
												РеквизитыЮрЛица.Наименование, РеквизитыЮрЛица.Адрес);
	
	СтруктураПараметровПечати.Вставить("ПодразделениеНаименование", ВРег(ПараметрыПечати.Подразделение));
	СтруктураПараметровПечати.Вставить("ПодразделениеНаименованиеРП", ВРег(ПараметрыПечати.Подразделение));
	СтруктураПараметровПечати.Вставить("ДолжностьПодписанта", ПараметрыПечати.ДолжностьПодписанта);
	
	Запрос	= Новый Запрос;
	Запрос.Текст	= ПолучитьТекстЗапросаПечатьАктОтбораПроб();
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	МассивРезультатов 		= Запрос.ВыполнитьПакет();
	
	РезультатДанныеПечати			= МассивРезультатов[1]; // РезультатЗапроса
	РезультатВыборкаПоРегистрациям	= МассивРезультатов[2]; // РезультатЗапроса
	РезультатВыборкаПоАнализам		= МассивРезультатов[3]; // РезультатЗапроса
	
	ДанныеПечати					= РезультатДанныеПечати.Выбрать();
	ВыборкаПоРегистрациям 			= РезультатВыборкаПоРегистрациям.Выбрать();
	ВыборкаПоАнализам 				= РезультатВыборкаПоАнализам.Выбрать();
	
	ПервыйДокумент	= Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		// Найдем в выборке товары по текущему документу
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоРегистрациям.Сбросить();
		ВыборкаПоАнализам.Сбросить();
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.гкс_ФормированиеНомераПробы.ПФ_MXL_АктОтбораКП");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;

		МассивТС = Новый Массив;
		СписокПоказателей = "";

		Пока ВыборкаПоРегистрациям.НайтиСледующий(СтруктураПоиска) Цикл

			Если Не ЗначениеЗаполнено(ВыборкаПоРегистрациям.ТранспортноеСредство) Тогда
				Продолжить;
			КонецЕсли;

			МассивТС.Добавить(ВыборкаПоРегистрациям.ТранспортноеСредство);

		КонецЦикла;

		МассивТСБезПовтора = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТСБезПовтора, МассивТС, Истина);
		СписокТС = СтрСоединить(МассивТСБезПовтора, ", ");
		
		Пока ВыборкаПоАнализам.НайтиСледующий(СтруктураПоиска) Цикл
			
			СписокПоказателей	= СписокПоказателей + ВыборкаПоАнализам.Показатель + ", ";
			
		КонецЦикла;
		
		ОбластьМакета	= Макет.ПолучитьОбласть("КолонтитулБольшой");		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтруктураПараметровПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета	= Макет.ПолучитьОбласть("Шапка");		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ОбластьМакета.Параметры.Дата	= Формат(ДанныеПечати.Дата, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета	= Макет.ПолучитьОбласть("ТелоДокумента");		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		
		ОбластьМакета.Параметры.ДатаИВремяОтбора	= Формат(ДанныеПечати.Дата, "ДФ='dd.MM.yyyy hh:mm:ss'");
		ОбластьМакета.Параметры.НаименованиеВидаОбразца	= ДанныеПечати.Номенклатура;
		ОбластьМакета.Параметры.НомерТС	= СписокТС;
		ОбластьМакета.Параметры.Композитная = ?(ДанныеПечати.ТипПробы = Перечисления.гкс_ТипыПроб.Композитная, 
		"√", "х");
		ОбластьМакета.Параметры.СписокПоказателей	= СписокПоказателей;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета	= Макет.ПолучитьОбласть("Подписи");		
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтруктураПараметровПечати);
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
				
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьТекстЗапросаПечатьАктОтбораПроб()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ФормированиеНомераПробы.Ссылка КАК Ссылка,
	|	ФормированиеНомераПробы.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ФормированиеНомераПробы.ТипПробы КАК ТипПробы,
	|	ФормированиеНомераПробы.НомерПробы КАК НомерПробы,
	|	ФормированиеНомераПробы.ПроизводственныеСуткиРегистрации КАК ПроизводственныеСуткиРегистрации,
	|	ВЫБОР
	|		КОГДА РегистрацияНаПЛК.Собственник ССЫЛКА Справочник.Организации
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(РегистрацияНаПЛК.Собственник, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК
	|				Справочник.Организации).Наименование
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(РегистрацияНаПЛК.Собственник, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК
	|			Справочник.Контрагенты).Наименование
	|	КОНЕЦ КАК ЗаявительНаименование,
	|	ФормированиеНомераПробы.Номер КАК Номер,
	|	ФормированиеНомераПробы.Дата КАК Дата,
	|	ЕСТЬNULL(РегистрацияНаПЛК.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(РегистрацияНаПЛК.ОтправительПолучатель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Грузоотправитель,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ГКСТранспортныйДокумент.ПунктПогрузки, ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)) КАК
	|		Справочник.гкс_ТочкиМаршрута).КодСтанцииЖД КАК СтанцияОтправления,
	|	ЕСТЬNULL(РегистрацияНаПЛК.ВидПеревозки, ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.БезДоставки)) КАК
	|		ВидПеревозки
	|ПОМЕСТИТЬ ВТ_ДанныеПечати
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК
	|					СвязьРегистрацииИТранспортногоДокумента
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ГКСТранспортныйДокумент
	|					ПО СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ГКСТранспортныйДокумент.Ссылка
	|				ПО РегистрацияНаПЛК.Ссылка = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
	|			ПО ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|		ПО (ФормированиеНомераПробыСписокРегистраций.Ссылка = ФормированиеНомераПробы.Ссылка)
	|		И (ФормированиеНомераПробыСписокРегистраций.НомерСтроки = 1)
	|ГДЕ
	|	ФормированиеНомераПробы.Ссылка В (&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПечати.Ссылка КАК Ссылка,
	|	ВТ_ДанныеПечати.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_ДанныеПечати.ТипПробы КАК ТипПробы,
	|	ВТ_ДанныеПечати.НомерПробы КАК НомерПробы,
	|	ВТ_ДанныеПечати.ПроизводственныеСуткиРегистрации КАК ПроизводственныеСуткиРегистрации,
	|	ВТ_ДанныеПечати.ЗаявительНаименование КАК ЗаявительНаименование,
	|	ВТ_ДанныеПечати.Номер КАК Номер,
	|	ВТ_ДанныеПечати.Дата КАК Дата,
	|	ВТ_ДанныеПечати.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеПечати.Грузоотправитель КАК Грузоотправитель,
	|	ВТ_ДанныеПечати.СтанцияОтправления КАК СтанцияОтправления,
	|	ВТ_ДанныеПечати.ВидПеревозки КАК ВидПеревозки,
	|	ЕСТЬNULL(НастройкиПечатиФормированияПроб.ОбъемПробы, 0) КАК ОбъемПробы
	|ИЗ
	|	ВТ_ДанныеПечати КАК ВТ_ДанныеПечати
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НастройкиПечатиФормированияПроб КАК НастройкиПечатиФормированияПроб
	|		ПО ВТ_ДанныеПечати.ТочкаМаршрута = НастройкиПечатиФормированияПроб.ТочкаМаршрута
	|		И ВТ_ДанныеПечати.Номенклатура = НастройкиПечатиФормированияПроб.Номенклатура
	|		И ВТ_ДанныеПечати.ТипПробы = НастройкиПечатиФормированияПроб.ТипПробы
	|		И ВТ_ДанныеПечати.ВидПеревозки = НастройкиПечатиФормированияПроб.ВидПеревозки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФормированиеНомераПробыСписокРегистраций.Ссылка КАК Ссылка,
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации,
	|	ЕСТЬNULL(РегистрацияНаПЛК.ТранспортноеСредство, ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)) КАК
	|		ТранспортноеСредство
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|ГДЕ
	|	ФормированиеНомераПробыСписокРегистраций.Ссылка В (&МассивДокументов)
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЛабораторныйАнализКачественныеПоказатели.Показатель,
	|		ЗНАЧЕНИЕ(Справочник.гкс_ПоказателиАнализовНоменклатуры.ПустаяСсылка)) КАК Показатель,
	|	ФормированиеНомераПробы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК
	|				ЛабораторныйАнализКачественныеПоказатели
	|			ПО ЛабораторныйАнализ.Ссылка = ЛабораторныйАнализКачественныеПоказатели.Ссылка
	|		ПО ФормированиеНомераПробы.Ссылка = ЛабораторныйАнализ.гкс_ДокументРегистрации
	|ГДЕ
	|	ФормированиеНомераПробы.Ссылка В (&МассивДокументов)
	|	И ФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Композитная)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЛабораторныйАнализКачественныеПоказатели.Показатель,
	|		ЗНАЧЕНИЕ(Справочник.гкс_ПоказателиАнализовНоменклатуры.ПустаяСсылка)),
	|	ФормированиеНомераПробы.Ссылка
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробыШапка
	|		ПО ФормированиеНомераПробы.Ссылка = ФормированиеНомераПробыШапка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК
	|				ЛабораторныйАнализКачественныеПоказатели
	|			ПО ЛабораторныйАнализ.Ссылка = ЛабораторныйАнализКачественныеПоказатели.Ссылка
	|		ПО ФормированиеНомераПробы.ДокументРегистрации = ЛабораторныйАнализ.гкс_ДокументРегистрации
	|		И (ФормированиеНомераПробы.НомерСтроки = 1)
	|ГДЕ
	|	ФормированиеНомераПробы.Ссылка В (&МассивДокументов)
	|	И ФормированиеНомераПробыШапка.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)";
	
	Возврат ТекстЗапроса
	
КонецФункции

Процедура ЗаполнитьШтрихкод(Штрихкод, ДанныеШтрихкода)
	
	КоличествоМиллиметровВПикселе = гкс_ОбщегоНазначенияПЛККлиентСервер.КоличествоМиллиметровВПикселе();
		
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",           Окр(Штрихкод.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",           Окр(Штрихкод.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",         ДанныеШтрихкода);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
	ПараметрыШтрихкода.Вставить("ТипКода",          3); // Code128
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",     12);
	
	Штрихкод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
КонецПроцедуры

Функция ЕстьШтрихкод(Рисунки)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("КартинкаШтрихкода", Новый УникальныйИдентификатор);
	СтароеЗначение = СтруктураПоиска.КартинкаШтрихкода;
	
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, Рисунки);
	
	Возврат Не СтруктураПоиска.КартинкаШтрихкода = СтароеЗначение;
	
КонецФункции

#КонецОбласти 

Функция ПолучитьДанныеДляПечатиЭтикеток(ДокументыФормированиеНомераПробы, ДокументыРегистрации = Неопределено)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументыРегистрации", ДокументыРегистрации);
	Запрос.УстановитьПараметр("СсылкиНаДокументыНомераПроб", ДокументыФормированиеНомераПробы);
	
	Запрос.Текст = ТекстЗапросаПолучитьДанныеДляПечатиЭтикеток(); 
		
	Если ДокументыРегистрации = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"ТаблицаРегистрации.ДокументРегистрации В(&ДокументыРегистрации)" , 
			"Истина");		
	КонецЕсли; 
	
	Возврат Запрос.Выполнить().Выбрать();
		
КонецФункции 

#Область ФормированиеЛабораторногоАнализа

Функция ЛабораторныйАнализПоФормированиюПробыУжеСуществует(ДокументОснование, ТипПробы, 
		НазначениеИспользованияКачества = Неопределено)
	
	ЛабораторныйАнализ = гкс_ПриемкаТранспорта.ОпределитьЛабораторныйАнализ(ДокументОснование, 
		НазначениеИспользованияКачества, ,ТипПробы);				         
	Возврат ЗначениеЗаполнено(ЛабораторныйАнализ);		         
	
КонецФункции

Функция ДокументОснованиеДляФормированияЛабораторногоАнализа(ФормированиеНомераПробы, РегистрацияТранспорта)
	
	Результат = Неопределено;
	
	ТипПробы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФормированиеНомераПробы, "ТипПробы");	
	Если ТипПробы = Перечисления.гкс_ТипыПроб.Композитная Тогда
		Результат = ФормированиеНомераПробы;
	ИначеЕсли ТипПробы = Перечисления.гкс_ТипыПроб.Единичная Тогда
		Результат = РегистрацияТранспорта;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция ДанныеДляФормированияЛабораторногоАнализа(ФормированиеНомераПробы, РегистрацияТранспорта)
	
	ИменаРеквизитов = "Организация, ТочкаМаршрута, гкс_ВидПеревозки, Номенклатура";
	ДанныеЗаполнения = Новый Структура(ИменаРеквизитов);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрацияНаПЛК.Организация КАК Организация,
		|	РегистрацияНаПЛК.ТочкаМаршрута КАК ТочкаМаршрута,
		|	РегистрацияНаПЛК.ВидПеревозки КАК гкс_ВидПеревозки,
		|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|ГДЕ
		|	РегистрацияНаПЛК.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", РегистрацияТранспорта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);	
	КонецЕсли;

	ДанныеЗаполнения.Вставить("гкс_ДокументРегистрации", 
		ДокументОснованиеДляФормированияЛабораторногоАнализа(ФормированиеНомераПробы, РегистрацияТранспорта));

	НазначениеИспользованияКачества = Перечисления.гкс_НазначенияИспользованияКачества.
		ЗначениеПоДокументуФормированиеНомераПробы(ФормированиеНомераПробы);
		
	ДанныеЗаполнения.Вставить("гкс_НазначениеИспользованияКачества", НазначениеИспользованияКачества);	
	ДанныеЗаполнения.Вставить("НомерПробы", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФормированиеНомераПробы.НомерПробы, "Код"));
	
	Возврат ДанныеЗаполнения;

КонецФункции

Функция ПроверитьФормированияЛабораторногоАнализа(ДокументОснование, ТипПробы, НазначениеИспользованияКачества)
	Возврат ЛабораторныйАнализПоФормированиюПробыУжеСуществует(ДокументОснование, ТипПробы,
			НазначениеИспользованияКачества)
		Или Не Документы.гкс_ЛабораторныйАнализ.ЗаблокироватьКонкурентноеСозданиеЛабораторногоАнализа(
			ДокументОснование); 	
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаПолучитьДанныеДляПечатиЭтикеток()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДокументФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ДокументРегистрация.ТранспортноеСредство, """"))
		|		ИНАЧЕ ""Композитная проба""
		|	КОНЕЦ КАК ТранспортноеСредствоПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ДокументРегистрация.ОтправительПолучатель, """")) КАК КонтрагентПредставление,
		|	// Добавлено поле станции отправления для вывода на этикетку композитной пробы (исправлено: из транспортного документа)
		|	ЕСТЬNULL(СтанцияОтправления.НаименованиеПолное, """") КАК СтанцияОтправленияНаименование,
		|	ДокументФормированиеНомераПробы.ТипПробы КАК ТипПробы,
		|	ДокументФормированиеНомераПробы.НомерПробы.Код КАК НомерПробы,
		|	ДокументФормированиеНомераПробы.Ссылка КАК ДокументФормированияНомераПробы,
		|	МАКСИМУМ(ЕСТЬNULL(НастройкиЭтикеток.КоличествоЭтикеток, 1)) КАК КоличествоЭкземпляров,
		|	ЕСТЬNULL(ДокументФормированиеНомераПробы.Дата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПробы, 
		|	ЕСТЬNULL(НаправлениеНаРазгрузку.Склад, """") КАК Силос
		|ИЗ
		|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ТаблицаРегистрации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК ДокументРегистрация
		|		ПО ТаблицаРегистрации.ДокументРегистрации = ДокументРегистрация.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
		|		ПО (НаправлениеНаРазгрузку.ДокументРегистрации = ДокументРегистрация.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ДокументФормированиеНомераПробы
		|		ПО ТаблицаРегистрации.Ссылка = ДокументФормированиеНомераПробы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НастройкиПечатиФормированияПроб КАК НастройкиЭтикеток
		|		ПО (НастройкиЭтикеток.ТочкаМаршрута = ДокументРегистрация.ТочкаМаршрута)
		|		И (НастройкиЭтикеток.Номенклатура = ДокументРегистрация.Номенклатура)
		|		И (НастройкиЭтикеток.ТипПробы = ДокументФормированиеНомераПробы.ТипПробы)
		|		И (НастройкиЭтикеток.ВидПеревозки = ДокументРегистрация.ВидПеревозки)
		|		// Добавлено соединение с регистром связи регистрации и транспортного документа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
		|		ПО ДокументРегистрация.Ссылка = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
		|		// Добавлено соединение с транспортным документом для получения станции отправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ДокументТранспортный
		|		ПО СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ДокументТранспортный.Ссылка
		|		// Добавлено соединение с пунктом погрузки для получения станции отправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК ПогрузкиПункт
		|		ПО ДокументТранспортный.ПунктПогрузки = ПогрузкиПункт.Ссылка
		|		// Добавлено соединение с классификатором станций ЖД для получения наименования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_КлассификаторСтанцийЖД КАК СтанцияОтправления
		|		ПО ПогрузкиПункт.КодСтанцииЖД = СтанцияОтправления.Ссылка
		
		|ГДЕ
		|	ТаблицаРегистрации.Ссылка В(&СсылкиНаДокументыНомераПроб)
		|	И ТаблицаРегистрации.ДокументРегистрации В(&ДокументыРегистрации)
		|СГРУППИРОВАТЬ ПО
		|	ДокументФормированиеНомераПробы.Ссылка,
		|	ДокументФормированиеНомераПробы.ТипПробы,
		|	ДокументФормированиеНомераПробы.НомерПробы.Код,
		|	ЕСТЬNULL(НаправлениеНаРазгрузку.Склад, """"),
		|	ВЫБОР
		|		КОГДА ДокументФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ДокументРегистрация.ТранспортноеСредство, """"))
		|		ИНАЧЕ ""Композитная проба""
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ДокументРегистрация.ОтправительПолучатель, """")),
		|	// Гкс+[GKSTCPLK-1486] Терлецкий АВ 25.06.2025 добавлено поле станции отправления в группировку (исправлено: из транспортного документа)
		|	ЕСТЬNULL(СтанцияОтправления.НаименованиеПолное, """")";	
	Возврат ТекстЗапроса;

	
КонецФункции

Функция ТекстЗапросаТаблицаСостояниеРегистрации(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_СостоянияРегистрации";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ФормированиеНомераПробы.Дата КАК Период,
	|	ФормированиеНомераПробы.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ФормированиеНомераПробы.Ссылка КАК Регистратор,
	|	ФормированиеНомераПробыТЧ.ДокументРегистрации КАК ДокументРегистрации,
	|	&Пользователь КАК Пользователь,
	|	Регистрация.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ВзятыПробы) КАК Состояние,
	|	Регистрация.ТипРегистрации КАК ТипРегистрации,
	|	Регистрация.ВидПеревозки КАК ВидПеревозки,
	|	ФормированиеНомераПробы.МестнаяДата КАК МестнаяДата
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|		ПО ФормированиеНомераПробыТЧ.Ссылка = ФормированиеНомераПробы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК Регистрация
	|		ПО ФормированиеНомераПробыТЧ.ДокументРегистрации = Регистрация.Ссылка
	|ГДЕ
	|	ФормированиеНомераПробыТЧ.Ссылка = &Ссылка
	|	И ФормированиеНомераПробыТЧ.ДокументРегистрации ССЫЛКА Документ.гкс_РегистрацияНаПЛК";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	 
КонецФункции

Функция ТекстЗапросаТаблицагкс_КомпозитныеПробы(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_КомпозитныеПробы";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РегистрацияНаПЛК.ТочкаМаршрута КАК ТочкаМаршрута,
	|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
	|	ФормированиеНомераПробы.ПроизводственныеСуткиРегистрации КАК ПроизводственныеСуткиРегистрации,
	|	ФормированиеНомераПробы.Ссылка КАК КомпозитнаяПроба,
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ФормированиеНомераПробы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|ГДЕ
	|	ФормированиеНомераПробыСписокРегистраций.Ссылка = &Ссылка
	|	И ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации ССЫЛКА Документ.гкс_РегистрацияНаПЛК";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти 

#КонецОбласти

#КонецЕсли
